Repository: saqibyounis/workout_tracker_magicai
Catalog: lib/l10n/intl_*.arb
Languages: cy

# title
source: Workout Tracker
cy: Traciwr Ymarfer Corff

source: No workout found!
cy: Dim ymarfer corff wedi'i ddarganfod!

source: Error
cy: Gwall

source: Finish
cy: Gorffen

source: Remove
cy: Tynnu

source: Workout Details
cy: Manylion Ymarfer Corff

source: Weight
cy: pwysau

source: Repetitions
cy: Ailadroddiadau

source: Workout on
cy: Ymarfer Corff ar

source: Total Sets:
cy: Cyfanswm y Setiau:

source: reps
cy: ailadroddiadau

source: In Progress
cy: Ar y Gweill

source: Finished
cy: Wedi Gorffen

source: Select Exercise
cy: Dewis Ymarfer Corff
